# 1) Створіть клас Студент, в ньому обявіть дві змінні імя де збережети імя студента,
# та список його оцінок.
# створіть два метода в цьому класі, перший метод який буде вітатись і при вітання
# використовувати імя студента.
# другий метод буде виводити оцінки. Методи виводять результат через прінти.
#
# Створіть два екземпляра цього класу, в другому екземплярі змніть імя на своє
# (не міняючи нічого в класі). Вивідіть дві
# функції цих екземплярів, що б кожен студент привітався та сказав свої оцінки.


# class Student:
#     name = "Olena"
#     marks = [10, 11, 12, 10, 10, 11]
#
#     def say_hello(self):
#         self.hello = f"Привіт, я {self.name}!"
#         print(self.hello)
#
#     def show_marks(self):
#         self.list_marks = f"Ось мої оцінки: {self.marks}"
#         print(self.list_marks)
#
# student_1 = Student()
# student_1.say_hello()
# student_1.show_marks()
#
# student_2 = Student()
# student_2.name = "Sabina"
# student_2.say_hello()
# student_2.show_marks()
# _________________________________________________________________________________________________________
# 3) обновіть requirements.txt
# Done!
# _________________________________________________________________________________________________________

# 4) ВСІ ЗАВДАННЯ ПОВИННІ БУТИ ПЕРЕВІРЕННІ flake8 за кожну помилку яку він знайде(окрім E501
# (там де кількість стрічок в ряд))
# буду знімати по 10 балів.
